public class gui_study {
    /*
    * 이벤트 : 불시에 일어나는 사건(화면 내에서 사용자에 의해 일어나는 것. ex) 마우스 컨트롤, 버튼 클릭, 키보드 클릭 등등)
    * 이벤트 구동 프로그램 : 이벤트 발생과 처리로 제어하는 프로그램 -> 액션 이벤트
    * 이벤트 처리기 : 이벤트를 처리하는 프로세스 -> 액션 리스너
    * -> 일반적으로, 이벤트를 여러번 처리하여 정보를 축적하였다가 결과를 보여주는 형태
    * 컴퍼넌트(component) : 화면에서 크기와 위치가 있고 이벤트가 발생하는 객체
    * 컨테이너 : -> 컴퍼넌트 여러개를 담을 수 있는 컴퍼넌트
    * 패널  표준 컨테이너
    * 윈도우 : 맨 위의 컨테이너 / 바로 화면에 보여주는 컨테이너 / 패널을 담은 컨테이너
    * 프레임 : 윈도우에 제목과 메뉴가 달린 것
    * 대화창 : 임시 윈도우
    * 메뉴바 : 메뉴가 있어서 선택할 수 있는 것, 프레임에 달려있음.
    *
    * */
}
